In [7]:
import pandas as pd

In [10]:
df = pd.read_csv("cats_dataset.csv")

In [11]:
df

                  Breed  Age (Years)  Weight (kg)          Color  Gender
0          Russian Blue           19            7  Tortoiseshell  Female
1      Norwegian Forest           19            9  Tortoiseshell  Female
2             Chartreux            3            3          Brown  Female
3               Persian           13            6          Sable  Female
4               Ragdoll           10            8          Tabby    Male
..                  ...          ...          ...            ...     ...
995   British Shorthair           19            5           Gray  Female
996   British Shorthair           11            2        Bicolor  Female
997            Savannah           12            5        Bicolor  Female
998  American Shorthair            8            3  Tortoiseshell  Female
999           Chartreux           11            4          Sable  Female

[1000 rows x 5 columns]

## Genel bilgiler

In [15]:
df.head()

              Breed  Age (Years)  Weight (kg)          Color  Gender
0      Russian Blue           19            7  Tortoiseshell  Female
1  Norwegian Forest           19            9  Tortoiseshell  Female
2         Chartreux            3            3          Brown  Female
3           Persian           13            6          Sable  Female
4           Ragdoll           10            8          Tabby    Male

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Breed        1000 non-null   object
 1   Age (Years)  1000 non-null   int64
 2   Weight (kg)  1000 non-null   int64
 3   Color        1000 non-null   object
 4   Gender       1000 non-null   object
dtypes: int64(2), object(3)
memory usage: 39.2+ KB

## İstatistiksel bilgiler

In [23]:
print("Kedilerin yaş ortalaması:", df["Age (Years)"].mean())
print("Kedilerin ağırlık ortalaması:", df["Weight (kg)"].mean())

Kedilerin yaş ortalaması: 10.21
Kedilerin ağırlık ortalaması: 5.55

In [24]:
df.describe()

       Age (Years)  Weight (kg)
count  1000.000000   1000.00000
mean     10.210000      5.55000
std       5.535751      2.22676
min       1.000000      2.00000
25%       5.000000      4.00000
50%      10.000000      6.00000
75%      15.000000      7.00000
max      19.000000      9.00000

## Filtreleme

In [25]:
filter_df = df[df["Age (Years)"] < 5]

In [31]:
filter_df.describe()

       Age (Years)  Weight (kg)
count   198.000000   198.000000
mean      2.520202     5.535354
std       1.125205     2.112631
min       1.000000     2.000000
25%       2.000000     4.000000
50%       2.500000     5.000000
75%       4.000000     7.000000
max       4.000000     9.000000